docs/stages/stage_3/app/controllers/categories_controller.rb

SELECT `categories`.* FROM `categories` LIMIT 6 OFFSET 0
---
  def index
    @categories = Category.paginate(page: params[:page], per_page: 6)

SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1
---
  def show
    @category = Category.find(params[:id])