docs/stages/stage_2/app/controllers/books_controller.rb

  def create
    @book = current_user.books.new(book_params)
    if @book.save
---
INSERT INTO `books` (`author`, `created_at`, `edition`, `issuu_id`, `published`, `published_at`, `publishing_house`, `title`, `updated_at`, `user_id`) VALUES ('saulo', '2013-09-16 23:31:27', 1, '130910053058-b0d57f68c625fbdbfc92cd79735d9fc7', 1, '1991-06-04', 'barzin', 'Teste', '2013-09-16 23:31:27', 3)