docs/stages/stage_3/app/views/books/_list.html.erb

      <div id='category'>
        <%- if book.categories.present? %>
          <%- book.categories.limit(4).each do |category| %>
---
SELECT `categories`.* FROM `categories` INNER JOIN `books_categories` ON `categories`.`id` = `books_categories`.`category_id` WHERE `books_categories`.`book_id` = 1
SELECT `categories`.* FROM `categories` INNER JOIN `books_categories` ON `categories`.`id` = `books_categories`.`category_id` WHERE `books_categories`.`book_id` = 1 LIMIT 4