docs/stages/stage_3/app/views/books/show.html.erb

SELECT `categories`.* FROM `categories` INNER JOIN `books_categories` ON `categories`.`id` = `books_categories`.`category_id` WHERE `books_categories`.`book_id` = 1
---
  <div class='info'>
    <%- unless @book.categories.blank?%>